// Фиксирует событие мониторинга в асинхронном режиме при включенном контроле лимитов
//
// Параметры:
//   Событие - Строка - наименование события
//   Уровень - Число - уровень события (уровень логирования)
//   Объект - <Произвольный> - объект, с которым связано событие
//   ДопДанные - Структура, <Произвольный> - дополнительные данные о событии
Процедура Зафиксировать(Событие, Уровень, Объект = Неопределено, ДопДанные = Неопределено) Экспорт
	ПараметрыСобытия = Новый Структура;
	ПараметрыСобытия = Новый Структура;
    ПараметрыСобытия.Вставить("Период",      ТекущаяДатаСеанса());
    ТекущийЮзер = Справочники.Пользователи.ПустаяСсылка();
	Попытка
    ТекущийЮзер = ПараметрыСеанса.ТекущийПользователь;
	Исключение
	КонецПопытки;
	ПараметрыСобытия.Вставить("Пользователь", ТекущийЮзер);
    ПараметрыСобытия.Вставить("Событие",     Событие);
	ПараметрыСобытия.Вставить("Уровень", Уровень);
    ПараметрыСобытия.Вставить("Объект",      Объект);
    ПараметрыСобытия.Вставить("ИмяКомпьютера", ИмяКомпьютера());
    ПараметрыСобытия.Вставить("НомерСеанса",   НомерСеансаИнформационнойБазы()); 
    
     Если ТипЗнч(ДопДанные) = Тип("Структура") Тогда
        ОписаниеТекст = "";
        Для каждого КлючИЗначение Из ДопДанные Цикл
            ОписаниеТекст = ОписаниеТекст + КлючИЗначение.Ключ + ": " + КлючИЗначение.Значение + "; ";
        КонецЦикла;
        ПараметрыСобытия.Вставить("Описание", ОписаниеТекст);   
        ПараметрыСобытия.Вставить("Данные", Новый ХранилищеЗначения(ДопДанные));
    Иначе
        ПараметрыСобытия.Вставить("Описание", Строка(ДопДанные));
   КонецЕсли;
   МассивПараметров = Новый Массив;
    МассивПараметров.Добавить(ПараметрыСобытия);
    ФоновыеЗадания.Выполнить("СЛ_ЛогированиеСервер.ЗаписатьВРегистрФон", МассивПараметров);
КонецПроцедуры    

// Записывает данные в регистр сведений СЛ_Контроль на основе переданных параметров.
//
// Параметры:
//   Параметры - Структура - свойства для заполнения записи регистра, возможно дополнительное свойство Данные
Процедура ЗаписатьВРегистрФон(Параметры) Экспорт
   МенеджерЗаписи = РегистрыСведений.СЛ_Контроль.СоздатьМенеджерЗаписи();
   ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Параметры);
   Если Параметры.Свойство("Данные") Тогда
        МенеджерЗаписи.Данные = Параметры.Данные;
    КонецЕсли;
    Попытка
        МенеджерЗаписи.Записать();
    Исключение
        ЗаписьЖурналаРегистрации("СЛ.ЗаписьФон", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
    КонецПопытки;
    
КонецПроцедуры

// Возвращает признак включения мониторинга для указанного вида события.
//
// Параметры:
//   ВидСобытия - Строка - идентификатор вида события
//
// Возвращаемое значение:
//   Булево - Истина, если мониторинг включен, иначе Ложь
Функция МониторингВключен(ВидСобытия) Экспорт
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ

    |	Регистр.Значение КАК Значение
    |ИЗ
    |	РегистрСведений.СЛ_ХранилищеНастроек КАК Регистр

    |ГДЕ
    |	Регистр.Настройка = &Настройка";
    
    Запрос.УстановитьПараметр("Настройка", ВидСобытия);
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Значение;
    КонецЕсли;
    
    Возврат Ложь;
КонецФункции