// Проверяет и обрабатывает документ перед записью, используя обязательные реквизиты из менеджера документа
//
// Параметры:
//   Источник - ДокументОбъект - документ, который записывается
//   Отказ - Булево - флаг отказа от записи
//   Режим - РежимЗаписиДокумента - режим записи документа
//   РежимПроведения - РежимПроведенияДокумента - режим проведения документа
Процедура ОбработкаДокументаПередЗаписью(Источник, Отказ, Режим, РежимПроведения) Экспорт
	ИмяДокумента = Источник.Метаданные().Имя;
	МассивОбязательныхРеквизитов = Неопределено;
	МассивОбязательныхРеквизитовТЧ = Неопределено;
	МодульМенеджера = Документы[ИмяДокумента];
	МассивОбязательныхРеквизитов = МодульМенеджера.ПолучитьМассивОбязательныхРеквизитов();
	Попытка
		МассивОбязательныхРеквизитовТЧ = МодульМенеджера.ПолучитьМассивОбязательныхРеквизитовТЧ();
	Исключение
		КонецПопытки;
	ДБ_ОбщегоНазначенияСервер.ОбработкаДокументовПередЗаписью(Источник, Отказ,МассивОбязательныхРеквизитов, МассивОбязательныхРеквизитовТЧ, Режим, РежимПроведения);
КонецПроцедуры