&НаКлиенте
Процедура КомандаРассчитать(Команда)
	ПересчитатьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура МесяцПланаПриИзменении(Элемент)
	АвтоПересчетЕслиМожно();
КонецПроцедуры


&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	АвтоПересчетЕслиМожно();
КонецПроцедуры


&НаКлиенте
Процедура АвтоПересчетЕслиМожно()
	Если ЗначениеЗаполнено(Объект.МесяцПлана)
		И ЗначениеЗаполнено(Объект.Пользователь) Тогда
		ПересчитатьНаСервере();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьНаСервере()
	Отказ = Ложь;
	ПересчитатьНаСервереВКонтексте(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	ЭтаФорма.ОбновитьОтображениеДанных();
КонецПроцедуры


&НаСервере
Процедура ПересчитатьНаСервереВКонтексте(Отказ)
	БюджетПланированиеСервер.ПересчитатьПланДокумента(Объект, Отказ);
КонецПроцедуры