Функция ПолучитьМассивОбязательныхРеквизитов() Экспорт
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить("МесяцПлана");
	МассивРеквизитов.Добавить("Пользователь");
	Возврат МассивРеквизитов;
КонецФункции

Функция ПолучитьМассивОбязательныхРеквизитовТЧ() Экспорт
	МассивРеквизитовТЧ = Новый Массив;
	МассивРеквизитовТЧ.Добавить("ОбязательныеТраты.Наименование");
	МассивРеквизитовТЧ.Добавить("ОбязательныеТраты.Сумма");
	МассивРеквизитовТЧ.Добавить("ПланПоКатегориям.Категория");
	МассивРеквизитовТЧ.Добавить("ПланПоКатегориям.ТипРаспределенияБюджета");
	МассивРеквизитовТЧ.Добавить("ПланПоКатегориям.Сумма");
	МассивРеквизитовТЧ.Добавить("ПланВложения.Направление");
	МассивРеквизитовТЧ.Добавить("ПланВложения.Актив");
	МассивРеквизитовТЧ.Добавить("ПланВложения.Валюта");
	МассивРеквизитовТЧ.Добавить("ПланВложения.Сумма");
	Возврат МассивРеквизитовТЧ;
КонецФункции