// Устанавливает значения параметров сеанса, включая параметр текущего пользователя.
//
// Параметры:
//   ИменаПараметров - Массив из Строка - список имен параметров сеанса для установки. Если Неопределено, устанавливаются все параметры.
Процедура УстановкаПараметровСеанса(ИменаПараметров) Экспорт
	Если ИменаПараметров = Неопределено ИЛИ ИменаПараметров.Найти("ТекущийПользователь") <> Неопределено Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
		ИмяПользователяИБ = ПользовательИБ.Имя;
		СсылкаНаПользователя = Справочники.Пользователи.НайтиПоРеквизиту("ИдентификаторПользователяИБ", ПользовательИБ.УникальныйИдентификатор);    
		Если СсылкаНаПользователя.Пустая() Тогда
			СсылкаНаПользователя = Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователяИБ);
		КонецЕсли;
		
		Если СсылкаНаПользователя.Пустая() И ЗначениеЗаполнено(ИмяПользователяИБ) Тогда
			СсылкаНаПользователя = СоздатьПользователяСправочник(ПользовательИБ);
		КонецЕсли;
		ПараметрыСеанса.ТекущийПользователь = СсылкаНаПользователя;
		КонецЕсли;
КонецПроцедуры 

// Создает элемент справочника Пользователи на основе пользователя информационной базы
//
// Параметры:
//   ПользовательИБ - ПользовательИнформационнойБазы - пользователь, для которого создается элемент справочника
//
// Возвращаемое значение:
//   СправочникСсылка.Пользователи - ссылка на созданный элемент справочника
//   - СправочникСсылка.Пользователи - пустая ссылка в случае ошибки записи
Функция СоздатьПользователяСправочник(ПользовательИБ)
	
	НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
	НовыйПользователь.Наименование = ПользовательИБ.Имя;
	НовыйПользователь.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
	НовыйПользователь.ОбменДанными.Загрузка = Истина;
	Попытка
		НовыйПользователь.Записать();
		Возврат НовыйПользователь.Ссылка;
	Исключение
		ТекстОшибки = "Ошибка автосоздания пользователя в справочнике: " + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("СЛ.ИнициализацияСеанса", 
			УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Справочники.Пользователи, , 
			ТекстОшибки);
		Возврат Справочники.Пользователи.ПустаяСсылка();	
	 КонецПопытки;
КонецФункции