Процедура ОбработкаПроведения(Отказ, Режим)
	Если Сумма < 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Сумма не может быть меньше нуля",,"Сумма","Объект",Отказ);
		КонецЕсли;
		
		
	СуммаВРублях = ДБ_ОбщегоНазначенияСервер.ПолучитьСуммуВРублях(Сумма, Валюта, Курс);
    
    // Остатки денег (в рублях)
    Движения.ОстаткиДенег.Записывать = Истина;
    Движения.ОстаткиДенег.Очистить();
    
    Движение = Движения.ОстаткиДенег.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
    Движение.Период = Дата;
    Движение.Пользователь = Пользователь;
    Движение.Валюта = Справочники.Валюты.НайтиПоКоду("RUB");
    Движение.Сумма = СуммаВРублях;
    
    // Обороты по категориям (в рублях)
    Движения.ОборотыПоКатегориям.Записывать = Истина;
    Движения.ОборотыПоКатегориям.Очистить();
    
    Движение = Движения.ОборотыПоКатегориям.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
    Движение.Период = Дата;
    Движение.Пользователь = Пользователь;
    Движение.Категория = Категория;
    Движение.Валюта = Справочники.Валюты.НайтиПоКоду("RUB");
    Движение.Сумма = СуммаВРублях;        
КонецПроцедуры


