Процедура ОбработкаПроведения(Отказ, Режим)
	
	// Переводим сумму в базовую валюту (RUB) для хранения
    СуммаВРублях = Сумма;
    Если Валюта <> Неопределено И Валюта.Код <> "RUB" Тогда
        СуммаВРублях = Сумма * Курс;
    КонецЕсли;

	
    Движения.ОстаткиДенег.Записывать = Истина;
    Движения.ОстаткиДенег.Очистить();
    
    Движение = Движения.ОстаткиДенег.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;  // Приход = увеличение
    Движение.Период = Дата;
    Движение.Пользователь = Пользователь;
    Движение.Сумма = СуммаВРублях;
    
    
КонецПроцедуры


