Процедура ОбработкаПроведения(Отказ, Режим)
    
	
	// Переводим сумму в базовую валюту (RUB) для хранения
    СуммаВРублях = Сумма;
    Если Валюта <> Неопределено И Валюта.Код <> "RUB" Тогда
        СуммаВРублях = Сумма * Курс;
    КонецЕсли;

    Движения.ОстаткиДенег.Записывать = Истина;
    Движения.ОстаткиДенег.Очистить();
    
    // 1. Списание у отправителя
    Движение = Движения.ОстаткиДенег.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
    Движение.Период = Дата;
    Движение.Пользователь = Отправитель;
    Движение.Сумма = Сумма;
    
    // 2. Зачисление получателю
    Движение = Движения.ОстаткиДенег.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Пользователь = Получатель;
    Движение.Сумма = Сумма;
    
КонецПроцедуры   


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
           Если ПустаяСтрока(Номер) Тогда   
        // Считаем количество существующих документов
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |    КОЛИЧЕСТВО(Документы.Ссылка) КАК Количество
        |ИЗ
        |    Документ.Перевод КАК Документы";
        
        Результат = Запрос.Выполнить();
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        
        СледующийНомер = Выборка.Количество + 1;
        
             Префикс = "П-";
        Год = Формат(Дата, "ДФ=yyyy");
        Номер = Префикс + Год + "-" + Формат(СледующийНомер, "ЧЦ=6; ЧВН=");
        
       КонецЕсли;
    
КонецПроцедуры
