Процедура ОбработкаПроведения(Отказ, Режим)
    
	
	// Переводим сумму в базовую валюту (RUB) для хранения
    СуммаВРублях = Сумма;
    Если Валюта <> Неопределено И Валюта.Код <> "RUB" Тогда
        СуммаВРублях = Сумма * Курс;
    КонецЕсли;

    Движения.ОстаткиДенег.Записывать = Истина;
    Движения.ОстаткиДенег.Очистить();
    
    // 1. Списание у отправителя
    Движение = Движения.ОстаткиДенег.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
    Движение.Период = Дата;
    Движение.Пользователь = Отправитель;
    Движение.Сумма = Сумма;
    
    // 2. Зачисление получателю
    Движение = Движения.ОстаткиДенег.Добавить();
    Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
    Движение.Период = Дата;
    Движение.Пользователь = Получатель;
    Движение.Сумма = Сумма;
    
КонецПроцедуры   



