

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
    ЗаполнитьКурсНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКурсНаСервере()
    
    Если Объект.Валюта = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    // Если валюта = RUB, курс = 1
    Если Объект.Валюта.Код = "RUB" Тогда
        Объект.Курс = 1;
        Возврат;
    КонецЕсли;
    
    // Получаем курс из регистра
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Курсы.Курс КАК Курс
    |ИЗ
    |    РегистрСведений.КурсыВалют.СрезПоследних(&Дата) КАК Курсы
    |ГДЕ
    |    Курсы.Валюта = &Валюта";
    
    Запрос.УстановитьПараметр("Дата", Объект.Дата);
    Запрос.УстановитьПараметр("Валюта", Объект.Валюта);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Объект.Курс = Выборка.Курс;
    Иначе
        Объект.Курс = 1;
        Сообщить("Курс для валюты " + Объект.Валюта + " не найден! Установлен курс 1.");
    КонецЕсли;
    
КонецПроцедуры

        
&НаКлиенте
Процедура КатегорияПриИзменении(Элемент)
	   ЛимитыИПредупреждения(); 
КонецПроцедуры

&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	ЛимитыИПредупреждения();
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	    ЛимитыИПредупреждения();
КонецПроцедуры

&НаКлиенте
Процедура ЛимитыИПредупреждения() 
	Если НЕ ЗначениеЗаполнено(Объект.Сумма) ИЛИ НЕ ЗначениеЗаполнено(Объект.Категория) ИЛИ НЕ ЗначениеЗаполнено(Объект.Пользователь) Тогда Возврат; КонецЕсли;
	   ЛимитКатегории = ДБ_ОбщегоНазначенияСервер.ПолучитьЛимитКатегории(Объект.Категория);
	    Если ЛимитКатегории = 0 Тогда Возврат; КонецЕсли;
	   РасходЗаМесяц = ДБ_ОбщегоНазначенияСервер.ПолучитьСуммуРасходаЗаМесяц(Объект.Категория, Объект.Пользователь);
	ОбщийРасход = РасходЗаМесяц + Объект.Сумма;
	ОстатокЛимита = ЛимитКатегории - РасходЗаМесяц;
	ПревышениеЛимита = Объект.Сумма - ОстатокЛимита;
		ТекстСообщения = СтрШаблон("Лимит: %1 | Прошлые расходы: %2 | Итого с текущим: %3 | ОСТАТОК: %4", 
		ЛимитКатегории, РасходЗаМесяц, ОбщийРасход, ОстатокЛимита);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения); 
		Если ОстатокЛимита< 0 Тогда
		ПоказатьПредупреждение(,"Внимание! Превышение лимита на " + ПревышениеЛимита);	
	КонецЕсли;
КонецПроцедуры

	  


