// Создает и проводит документ изменения стоимости актива "Т-банк инвестокопилка" с пополнением на 300 единиц
Процедура  СоздатьИПровестиЕжедневныйДокумент() Экспорт
	НовыйДок = Документы.ИзменениеСтоимостиАктива.СоздатьДокумент();
	НовыйДок.Дата = ТекущаяДата();
	НовыйДок.Актив = Константы.ОсновнойАктивДляАвтопополнения.Получить();
	ЗаполнитьПоАктиву.ЗаполнитьПоАктиву(НовыйДок);
	НовыйДок.ТипИзменения = Перечисления.ТипОперацииАктивов.Пополнение;
	НовыйДок.НоваяЦена = НовыйДок.ТекущаяСтоимость + 300;
	Попытка 
		НовыйДок.Записать(РежимЗаписиДокумента.Проведение);
		ЗаписьЖурналаРегистрации("ЕжедневноеСозданиеДокумента", УровеньЖурналаРегистрации.Информация,,, "Документ создан успешно:"  + НовыйДок.Ссылка);
	Исключение
		ЗаписьЖурналаРегистрации("ЕжедневноеСозданиеДокумента", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		КонецПопытки;
	КонецПроцедуры